tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "rigellute/tap"
brew "ack"
brew "aria2"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "berkeley-db"
brew "boost"
brew "brotli"
brew "btop"
brew "c-ares"
brew "cffi"
brew "cmake"
brew "coreutils"
brew "cpanminus"
brew "curl"
brew "diff-so-fancy"
brew "docbook"
brew "docbook-xsl"
brew "libyaml"
brew "dotbot"
brew "duf"
brew "fd"
brew "freetype"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gdbm"
brew "gdk-pixbuf"
brew "gh"
brew "giflib"
brew "git"
brew "glow"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grc"
brew "guile"
brew "handbrake"
brew "hstr"
brew "icdiff"
brew "imlib2"
brew "irssi"
brew "jq"
brew "jrnl"
brew "libpthread-stubs"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libxslt"
brew "libzip"
brew "lolcat"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "luv"
brew "make"
brew "most"
brew "msgpack"
brew "ncdu"
brew "neovim"
brew "node"
brew "pcre"
brew "perl"
brew "pipx"
brew "portaudio"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "screenfetch"
brew "shellcheck"
brew "source-highlight"
brew "starship"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "util-linux"
brew "vale"
brew "vercel-cli"
brew "watch"
brew "wget"
brew "xmlto"
brew "yarn"
brew "yt-dlp"
brew "zsh-completions"
cask "docker"
cask "git-credential-manager"
